/*
Navicat MySQL Data Transfer

Source Server         : mysql
Source Server Version : 50624
Source Host           : localhost:3306
Source Database       : water

Target Server Type    : MYSQL
Target Server Version : 50624
File Encoding         : 65001

Date: 2016-09-27 09:29:16
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for tb_customer
-- ----------------------------
DROP TABLE IF EXISTS `tb_customer`;
CREATE TABLE `tb_customer` (
  `id` varchar(100) NOT NULL COMMENT '客户编号',
  `manager` varchar(100) DEFAULT NULL COMMENT '客户经理',
  `name` varchar(50) DEFAULT NULL COMMENT '客户名称',
  `type` int(2) DEFAULT NULL COMMENT '客户类型',
  `grade` int(2) DEFAULT NULL COMMENT '用户等级',
  `card_no` varchar(30) DEFAULT NULL COMMENT '证件号码',
  `account` varchar(100) DEFAULT NULL COMMENT '客户账号',
  `birthday` date DEFAULT NULL COMMENT '客户生日',
  `hobby` varchar(500) DEFAULT NULL COMMENT '客户爱好',
  `contact` varchar(100) DEFAULT NULL COMMENT '联系方式',
  `remark` varchar(500) DEFAULT NULL COMMENT '备注',
  `status` int(2) DEFAULT '1' COMMENT '状态，1表正常，0表示删除',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '修改时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='客户关系表';

-- ----------------------------
-- Records of tb_customer
-- ----------------------------
INSERT INTO `tb_customer` VALUES ('1', '11111', '客户名称1', '2', '2', '3503211', '19901', '2016-09-24', '爱好1', '联系方式1', '备注1', '0', '2016-09-24 15:56:56', '2016-09-26 18:49:02');
INSERT INTO `tb_customer` VALUES ('10', '1111101', '客户名称101', '2', '3', '350321101', '1990101', '2016-09-30', '爱好101', '联系方式101', '备注101', '1', '2016-09-24 15:56:56', '2016-09-26 19:14:11');
INSERT INTO `tb_customer` VALUES ('11', '111111', '客户名称11', '2', '2', '35032111', '199011', '2016-09-24', '爱好11', '联系方式11', '备注11', '1', '2016-09-24 15:56:56', '2016-09-24 15:56:56');
INSERT INTO `tb_customer` VALUES ('111', null, '测试', '2', '3', '23665', '2255', null, '打球呢', '15998745', '测试', '1', '2016-09-24 18:22:34', '2016-09-24 18:22:34');
INSERT INTO `tb_customer` VALUES ('1111', '11', '小明', '2', '2', '25665', '2222', '1990-02-06', '打球，唱歌', '15998788', '备注没有', '1', '2016-09-26 19:12:51', '2016-09-26 19:12:51');
INSERT INTO `tb_customer` VALUES ('12', '111112', '客户名称12', '1', '1', '35032112', '199012', '2016-09-24', '爱好12', '联系方式12', '备注12', '1', '2016-09-24 15:56:56', '2016-09-24 15:56:56');
INSERT INTO `tb_customer` VALUES ('13', '111113', '客户名称13', '2', '2', '35032113', '199013', '2016-09-24', '爱好13', '联系方式13', '备注13', '1', '2016-09-24 15:56:56', '2016-09-24 15:56:56');
INSERT INTO `tb_customer` VALUES ('14', '111114', '客户名称14', '1', '1', '35032114', '199014', '2016-09-24', '爱好14', '联系方式14', '备注14', '1', '2016-09-24 15:56:56', '2016-09-24 15:56:56');
INSERT INTO `tb_customer` VALUES ('15', '111115', '客户名称15', '2', '2', '35032115', '199015', '2016-09-24', '爱好15', '联系方式15', '备注15', '1', '2016-09-24 15:56:56', '2016-09-24 15:56:56');
INSERT INTO `tb_customer` VALUES ('16', '111116', '客户名称16', '1', '1', '35032116', '199016', '2016-09-24', '爱好16', '联系方式16', '备注16', '1', '2016-09-24 15:56:56', '2016-09-24 15:56:56');
INSERT INTO `tb_customer` VALUES ('17', '111117', '客户名称17', '2', '2', '35032117', '199017', '2016-09-24', '爱好17', '联系方式17', '备注17', '1', '2016-09-24 15:56:56', '2016-09-24 15:56:56');
INSERT INTO `tb_customer` VALUES ('18', '111118', '客户名称18', '1', '1', '35032118', '199018', '2016-09-24', '爱好18', '联系方式18', '备注18', '1', '2016-09-24 15:56:56', '2016-09-24 15:56:56');
INSERT INTO `tb_customer` VALUES ('19', '111119', '客户名称19', '2', '2', '35032119', '199019', '2016-09-24', '爱好19', '联系方式19', '备注19', '1', '2016-09-24 15:56:56', '2016-09-24 15:56:56');
INSERT INTO `tb_customer` VALUES ('2', '11112', '客户名称2', '1', '1', '3503212', '19902', '2016-09-24', '爱好2', '联系方式2', '备注2', '1', '2016-09-24 15:56:56', '2016-09-24 15:56:56');
INSERT INTO `tb_customer` VALUES ('3', '11113', '客户名称3', '2', '2', '3503213', '19903', '2016-09-24', '爱好3', '联系方式3', '备注3', '1', '2016-09-24 15:56:56', '2016-09-24 15:56:56');
INSERT INTO `tb_customer` VALUES ('4', '11114', '客户名称4', '1', '1', '3503214', '19904', '2016-09-24', '爱好4', '联系方式4', '备注4', '1', '2016-09-24 15:56:56', '2016-09-24 15:56:56');
INSERT INTO `tb_customer` VALUES ('5', '11115', '客户名称5', '2', '2', '3503215', '19905', '2016-09-24', '爱好5', '联系方式5', '备注5', '1', '2016-09-24 15:56:56', '2016-09-24 15:56:56');
INSERT INTO `tb_customer` VALUES ('6', '11116', '客户名称6', '1', '1', '3503216', '19906', '2016-09-24', '爱好6', '联系方式6', '备注6', '1', '2016-09-24 15:56:56', '2016-09-24 15:56:56');
INSERT INTO `tb_customer` VALUES ('7', '11117', '客户名称7', '2', '2', '3503217', '19907', '2016-09-24', '爱好7', '联系方式7', '备注7', '1', '2016-09-24 15:56:56', '2016-09-24 15:56:56');
INSERT INTO `tb_customer` VALUES ('8', '11118', '客户名称8', '1', '1', '3503218', '19908', '2016-09-24', '爱好8', '联系方式8', '备注8', '1', '2016-09-24 15:56:56', '2016-09-24 15:56:56');
INSERT INTO `tb_customer` VALUES ('9', '11119', '客户名称9', '2', '2', '3503219', '19909', '2016-09-24', '爱好9', '联系方式9', '备注9', '1', '2016-09-24 15:56:56', '2016-09-24 15:56:56');
